{
  "projectCards": [
    {
      "id": 1,
      "title": "Blackjack Game",
      "subtitle": "JS/CSS/HTML Startup",
      "text": "This is a vanilla JS/CSS/HTML project I used to learn about web development and get exposure to different kinds of web technologies from the ground up. As the name suggests, the business logic is a blackjack simulator that you can bet pseudo money against. It taught me a lot about the DOM and events in the browser. You can login/register, see others earnings online (via websockets), look at a scoreboard, and play blackjack (of course).",
      "href": "https://startup.harrisondcole.click"
    },
    {
      "id": 2,
      "title": "Simon Game",
      "subtitle": "React.js Demo",
      "text": "This is a React.js project that mimics the classic Simon game. It was my first exposure to React, and actually started as a vanilla project so that we could understand its roots. More than anything, it act as a great resource for understanding how projects are built and deployed and the elements that go into a good web application. While Simon is a simple concept, there are a lot of features in the site that are added as examples of something more scalable, e.g. working with sound, making requests to an API, communication between users, etc.",
      "href": "https://simon.harrisondcole.click"
    }
  ],
  "ideas": [
    {
      "id": 1,
      "title": "Tic-Tac-Toe",
      "text": "This is a simple game that I think would be a good project to learn about the basics of React. It would be a good way to learn about state management and how to pass data between components. It would also be a good way to learn about the lifecycle of a React component and how to handle user input."
    },
    {
      "id": 2,
      "title": "Weather App",
      "text": "This is a project that I think would be a good way to learn about working with APIs. It would be a good way to learn about how to make requests to an API and how to handle the data that is returned. It would also be a good way to learn about how to display data on a webpage and how to make it interactive."
    },
    {
      "id": 3,
      "title": "To-Do List",
      "text": "This is a project that I think would be a good way to learn about state management in React. It would be a good way to learn about how to manage the state of a component and how to update it based on user input. It would also be a good way to learn about how to handle user input and how to display data on a webpage."
    },
    {
      "id": 4,
      "title": "Calculator",
      "text": "This is a project that I think would be a good way to learn about working with forms in React. It would be a good way to learn about how to handle user input and how to update the state of a component based on that input. It would also be a good way to learn about how to display data on a webpage and how to make it interactive."
    },
    {
      "id": 5,
      "title": "Blog",
      "text": "This is a project that I think would be a good way to learn about working with databases in React. It would be a good way to learn about how to store data in a database and how to retrieve it. It would also be a good way to learn about how to display data on a webpage and how to make it interactive."
    },
    {
      "id": 6,
      "title": "Chat App",
      "text": "This is a project that I think would be a good way to learn about working with websockets in React. It would be a good way to learn about how to send and receive data in real-time. It would also be a good way to learn about how to display data on a webpage and how to make it interactive."
    },
    {
      "id": 7,
      "title": "E-Commerce Site",
      "text": "This is a project that I think would be a good way to learn about working with APIs in React. It would be a good way to learn about how to make requests to an API and how to handle the data that is returned. It would also be a good way to learn about how to display data on a webpage and how to make it interactive."
    },
    {
      "id": 8,
      "title": "Portfolio Site",
      "text": "This is a project that I think would be a good way to learn about working with CSS in React. It would be a good way to learn about how to style a webpage and how to make it responsive. It would also be a good way to learn about how to display data on a webpage and how to make it interactive."
    },
    {
      "id": 9,
      "title": "Social Media Site",
      "text": "This is a project that I think would be a good way to learn about working with databases in React. It would be a good way to learn about how to store data in a database and how to retrieve it. It would also be a good way to learn about how to display data on a webpage and how to make it interactive."
    },
    {
      "id": 10,
      "title": "Recipe App",
      "text": "This is a project that I think would be a good way to learn about working with APIs in React. It would be a good way to learn about how to make requests to an API and how to handle the data that is returned. It would also be a good way to learn about how to display data on a webpage and how to make it interactive."
    }
  ]
}
